Tekla.Structures.TeklaStructuresInternal.AsyncCallCompletion`1.FromProxy``2(``0,``1,System.Action{``0,``1,Tekla.Structures.Internal.IAsyncCallCompletion{`0}})
Provides wrapped asyncronous facade for proxied call.
The argument type.
The argument type.
arg0: The argument.
arg1: The argument.
beginProxy: Proxied begin call.
Returns: Awaitable task which returns the result.

Tekla.Structures.TeklaStructuresInternal.AsyncCallCompletion`1.FromProxy``3(``0,``1,``2,System.Action{``0,``1,``2,Tekla.Structures.Internal.IAsyncCallCompletion{`0}})
Provides wrapped asyncronous facade for proxied call.
The argument type.
The argument type.
The argument type.
arg0: The argument.
arg1: The argument.
arg2: The argument.
beginProxy: Proxied begin call.
Returns: Awaitable task which returns the result.

Tekla.Structures.TeklaStructuresInternal.AsyncCallCompletion`1.OnException(System.Exception)
